//3차원 배열 정의하는 예제
int main() {
    int i[2][3][4]={
        {
            {1,2,3,4},
            {5,6,7,8},
            {9,10,11,12}
        },
        {
            {13,14,15,16},
            {17,18,19,20},
            {21,22,23,24} }
    };

    for (int x1 = 0; x1 < 2; x1++)
    {
        for (int x2 = 0; x2 < 3; x2++)
        {
            for (int x3 = 0; x3 < 4; x3++)
            {
                printf("%p ", i[x1][x2][x3]);
            }
            printf("\n");
        }
        printf("\n");
    }
    return 0;
}